from aiogram.utils.markdown import text, hbold, hlink

# Константи для повторюваних елементів
DOUBLE_TAB: str = "\t\t"

# Повідомлення для стартового хендлера
msg_handle_start: str = text(
    hbold("📢 Привіт, {name}!"),
    DOUBLE_TAB
    + (
        "Ми помітили, що у твоєму профілі учасника бігового клубу не заповнені всі дані.\n"
        "Щоб ми могли краще організовувати тренування та заходи, будь ласка, доповни свій профіль.\n"
        "Це займе всього кілька хвилин! 😊"
    ),
    hbold("Для отримання додаткової інформації:"),
    "натисніть на кнопку "
    + hlink("тут", "tg://resolve?domain=@BaseSMLbot&start=urlpay"),
    sep="\n\n",
)

# Кнопки
btn_yes: str = text("👍 Так")
btn_no: str = text("👎 Ні")
btn_cancel: str = text("🚫 Скасувати")

# Інші повідомлення
msg_dob: str = text("📅 Будь ласка, введіть вашу дату народження у форматі DD.MM.YYYY:")
msg_phone: str = text("Натисніть кнопку нижче, щоб поділитися номером 📲")
